


familyName = "Бобов Дмитрий"
studying = 3

print(f'\tМеня зовут {familyName}, я ученик школы "ТОП". Изучаю Python уже целых {studying} месяца.\n\n\tУже прошел часть по фронт-енд, особенно понравилось узнать про HTML и CSS. Java более сложно заходит в обучение, особенно функции "DOOM". Хотелось бы потом еще более подробно изучить и понять данный язык програмирования. Хотя язык очень интересный в плане програмирования фронт-енда.\n\n\tСогласен с Владимиром, что програмирование это марафон, который надо еще пройти. Надеюсь, что у меня хватит сил и мотивации это сджелать. Рад учиться у такого учителя как Владимир, и восхищаюсь людьми, которые так легко имеют програмировать.')




# Первая домашка - изучаем первые азы пайтона




